artillery/first-test.yml
config:
  target: "http://csbox.io/api/loadtest?email=loadtest@csbox.io&password=password123"
phases:
  - duration: 60
    arrivalRate: 1
    rampTo: 5
    name: Warm up phase
  - duration: 60
    arrivalRate: 5
    rampTo: 10
    name: Ramp up load
  - duration: 30
    arrivalRate: 10
    rampTo: 30
    name: Spike phase
scenarios:
  - flow:
      - get:
          url: "/d"
      - get:
          url: "/d/courses/"
      - get:
          url: "/d/courses/593010239"
      - get:
          url: "/d/courses/593010239/assignments/"