artillery/first-test.yml
config:
  target: "http://csbox.io"
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 5
      name: Warm up phase
    - duration: 20
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 30
      arrivalRate: 50
      rampTo: 200
      name: Spike phase
scenarios:
  - flow:
      - get:
          url: "/api/loadtest?email=loadtest@csbox.io&password=password123"
      - get:
          url: "/d"
      - get:
          url: "/d/courses/"
      - get:
          url: "/d/courses/593010239"
      - get:
          url: "/d/courses/593010239/assignments/"